"""
Задача #1
Дано прямокутний трикутник.
Треба обчислити його периметр, якщо відомі:
Обидва катети
Один катет та гіпотенуза
При виведенні значення повинні округлятися до двох знаків після коми (до сотих).
"""
a = ...
print(type(...))
b = 0
2 / b


"""
Задача #2
Дано довільний рядок-речення з 5-10 слів.
Необхідно вивести:
Весь рядок, де кожне слово починається з великої літери
Довжину рядка
Кожен другий символ рядка у нижньому регістрі
Кожен третій символ у верхньому регістрі
Рядок, записаний задом наперед
Рядок з поміняними місцями першою і другою половинами
"""